// 1. შექმენით მასივი, რომლის საწყისი მნიშვნელობა იქნება რიცხვები: 5, 25, 89, 120, 36;

//   მასივის ბოლოში დაამატეთ ორი ელემენტი(სტრინგი): javascript და python;
//   მასივის დასაწყისში კი დაამატეთ ელემენტი(სტრინგი): html და css;
//   გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
//   წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;
//   დაბეჭდეთ მასივისი ახალი ელემენტები.

let array = [5, 25, 89, 120, 36];

// მასივის ტავსა და ბოლოში ელემენტების დამატება
array.push("JavaScript", "Python");
array.unshift("html", "CSS");

console.log(array);

// მასივში არსებული ელემენტების რაოდენობის გამოტანა
console.log(array.length);

//პირველი და ბოლო ელემენტის წაშლა
array.shift(0);
array.pop(0);

console.log(array);

// 2. შექმენით მასივი, შემდეგი ელემენტებით: ფორთოხალი, ბანანი, მსხალი;

//   გამოიტანეთ ინფორმაცია ეკრანზე თუ რამდენი ელემენტი გაქვთ მასივში;
//   მასივის ბოლოს დაამატეთ ორი ელემენტი: ვაშლი და ანანასი;
//   მასივის დასაწყისში კი დაამატეთ ელემენტი: საზამთრო;
//   გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
//   მასივის მე-3 ადგილას დაამატეთ ელემენტი: მანგო;
//   წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;
//   გამოიტანეთ ეკრანზე, თუ რამდენი ელემენტი დარჩა მასივში;

let array1 = ["ფორთოხალი", "ბანანი", " მსხალი"];

// მასივში ელემენტების როდემობის გამოტანა
console.log(array1.length);

// მასივის ბოლოში ელემენტების ვაშლი და ანანასის დამატება, ხოლო დასაწყისში "საზამთროს" დამატება
array1.push("ვაშლი", "ანანასი");
array1.unshift("საზამთრო");

console.log(array1);

// მასივში ელემენტების რაოდენობების გამოტანა
console.log(array1.length);

// მასივის მე-3 ადგილას მანგოს დამატება
array1.splice(2, 0, "მანგო");
console.log(array1);

// მასივიდან პირველი და ბოლოელემენტის წაშლა
array1.shift(0);
array1.pop(0);
console.log(array1);
// მასივიში დარჩენილი ელემენტების რაოდენობა
console.log(array1.length);

// 3. მოცემულია მასივი let array =[1, 2, 3, 4, 5]. Splice მეთოდის საშუალებით მიიღეთ: [1, 2, 3, 'a', 'b', 'c', 4, 5].

let array2 = [1, 2, 3, 4, 5];

array2.splice(3, 0, "a", "b", "c");

console.log(array2);

// 4. მოცემულია მასივი:

// let arr = [1, 2, 3, 4, 5];
// Foreach საშუალებით გამოთვალეთ რიცხვების ჯამი

let array3 = [1, 2, 3, 4, 5];
let mysum = 0;

array3.forEach(function (item) {
  mysum += item;
  return mysum;
});

console.log(mysum);

// 5. ციკლის საშუალებით გამოიტანეთ რიცხვების სვეტი 100 დან 1 მდე;

let array4 = [
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,
  23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41,
  42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
  61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
  80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98,
  99, 100,
];

array4.reverse().forEach((x) => console.log(x)); // ეს სინტაქსი მომეწონა, ჩვენი დავალებები მოიცვა მთლიანად, ამიტომ რაც აგვისენით ისე აღარ ჩავწერე

// 6. დაწერეთ ფუნქცია, რომელსაც პარამეტრად გადაეცემა ორი რიცხვი(ნებისმიერი ჩაწერეთ) და რომელიც შეასრულებს შემდეგ ლოგიკას:
// თუ პირველი რიცხვი მეტია მეორეზე დაიბეჭდოს - num1 is the largest; თუ მეორე რიცხვი მეტია პირველზე - დაიბეჭდოს num2 is the largest; ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - error;

function myFunction(num1, num2) {
  if (num1 > num2) {
    console.log("num1 is the largest");
  } else if (num1 < num2) {
    console.log("num2 is the largets");
  } else {
    console.log("error");
  }
  return myFunction;
}

console.log(myFunction(5, 15));

// 7. მოცემულია მასივი: let array = [12, 25, 3, 6, 8, 14, 7, 23];
// map-ის გამოყენებით შექმენით ახალი მასივი, რომელშიც array მასივიდან თითოეული ელემენტი იქნება 3-ზე გაყოფილი;

let array5 = [12, 25, 3, 6, 8, 14, 7, 23];

let newarray = array5.map((item) => item / 3);

console.log(newarray);

// 8. მოცემულია მასივი:
// let languages = ['html', 'css', 'javascript', ‘python’, 'php'];
// ფილტრის საშულებით გაფილტრეთ და გამოიტანეთ მარტო ის სიტყვები რომლების სიმბოლოების რაოდენობა იქნება 3-ზე მეტი;

let languages = ["html", "css", "javascript", "python", "php"];

let newlanguages = languages.filter(function (x) {
  if (x.length > 3) {
    return x;
  }
});

console.log(newlanguages);

// 9.  Მოცემულია მასივი:
// let words = ['Madrid', 'Rome', 'Milan', 'Berlin'];
// Filter მეთოდის საშუალებით დააბრუნეთ მასივი, რომელიც შედგება ისეთი სიტყვებისგან რომელიც შეიცავს ასო m-ს ან M-ს;

let words = ["Madrid", "Rome", "Milan", "Berlin"];

let newwords = words.filter(myword => myword.includes('m') || myword.includes('M'))
console.log(newwords);

// let newwords = words.filter(function (x) {});

// 10.შეამოწმეთ მოცელუმ მასივში let arr = [-1, -2, -3, 4]; არის თუ არა ერთი მაინც დადებითი რიცხვი some მეთიდით.

let values = [-1, -2, -3, 4];

let positive = values.some((val) => val < 0);
console.log(positive);

// 11. მოცემულია მასივი:
// Let array=[2,15,10,24] წაშალეთ ამ
// მასივიდან რიცხვი 10;

let array6 = [2, 15, 10, 24];

filteredarr6 = array6.filter((v) => v !== 10);

console.log(filteredarr6);
